SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg28/zwave_efr32xg28_configurator_out.c
static const uint32_t phyInfo_4[] = {
  19UL,
  0x0038E38EUL, // 56.88888888888889
  (uint32_t) NULL,
  (uint32_t) irCalConfig,
  (uint32_t) timingConfig_2,
  0x00000000UL,
  8UL,
  0UL,
  100000UL,
  0x00F20101UL,
  0x07004EC4UL,
  (uint32_t) NULL,
  (uint32_t) hfxoRetimingConfigEntries,
  270UL,
  0UL,
  0UL,
  100001UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) 0UL,
};

const uint32_t zwave_40kb_modemConfigBase[] = {
  0x00064030UL, 0x00000000UL, /* Write: FRC.WHITECTRL */
  /*    4034 */ 0x00000000UL, /* FRC.WHITEPOLY */
  /*    4038 */ 0x00000000UL, /* FRC.WHITEINIT */
  /*    403C */ 0x00000000UL, /* FRC.FECCTRL */
  /*    4040 */ 0x00000000UL, /* FRC.BLOCKRAMADDR */
  /*    4044 */ 0x00006000UL, /* FRC.CONVRAMADDR */
  0x00014050UL, 0x00000000UL, /* Write: FRC.TRAILTXDATACTRL */
  0x0002405CUL, 0x00000000UL, /* Write: FRC.CONVGENERATOR */
  /*    4060 */ 0x00000000UL, /* FRC.PUNCTCTRL */
  0x000140A8UL, 0x00000007UL, /* Write: FRC.AUTOCG */
  0x000440BCUL, 0x00000000UL, /* Write: FRC.WCNTCMP3 */
  /*    40C0 */ 0x00000000UL, /* FRC.BOICTRL */
  /*    40C4 */ 0x00000000UL, /* FRC.DSLCTRL */
  /*    40C8 */ 0x00000000UL, /* FRC.WCNTCMP4 */
  0x1001C024UL, 0x000000FFUL, /* AND: AGC.CTRL1 */
  0x3001C024UL, 0x00001300UL, /* OR: AGC.CTRL1 */
  0x0005C028UL, 0x03B380ECUL, /* Write: AGC.CTRL2 */
  /*    C02C */ 0x51407543UL, /* AGC.CTRL3 */
  /*    C030 */ 0xF8000FA0UL, /* AGC.CTRL4 */
  /*    C034 */ 0x00004030UL, /* AGC.CTRL5 */
  /*    C038 */ 0x0007AAA8UL, /* AGC.CTRL6 */
  0x0002C040UL, 0x00000000UL, /* Write: AGC.RSSISTEPTHR */
  /*    C044 */ 0x00000000UL, /* AGC.MANGAIN */
  0x0001C054UL, 0x00302187UL, /* Write: AGC.GAINRANGE */
  0x0001C068UL, 0x000358D1UL, /* Write: AGC.STEPDWN */
  0x000DC070UL, 0x000010BAUL, /* Write: AGC.GAINSTEPLIM1 */
  /*    C074 */ 0x003F0000UL, /* AGC.PNRFATT0 */
  /*    C078 */ 0x00EE008DUL, /* AGC.PNRFATT1 */
  /*    C07C */ 0x03AC01F6UL, /* AGC.PNRFATT2 */
  /*    C080 */ 0x079604F5UL, /* AGC.PNRFATT3 */
  /*    C084 */ 0x0D9C09DEUL, /* AGC.PNRFATT4 */
  /*    C088 */ 0x179311C3UL, /* AGC.PNRFATT5 */
  /*    C08C */ 0x26F51DFEUL, /* AGC.PNRFATT6 */
  /*    C090 */ 0x3FFF32BDUL, /* AGC.PNRFATT7 */
  /*    C094 */ 0x1BF815FEUL, /* AGC.PNRFATT8 */
  /*    C098 */ 0x2DB423DCUL, /* AGC.PNRFATT9 */
  /*    C09C */ 0x3FFF39D0UL, /* AGC.PNRFATT10 */
  /*    C0A0 */ 0x00003FFFUL, /* AGC.PNRFATT11 */
  0x0005C0A8UL, 0x15724BBDUL, /* Write: AGC.LNAMIXCODE0 */
  /*    C0AC */ 0x0518A311UL, /* AGC.LNAMIXCODE1 */
  /*    C0B0 */ 0x76543210UL, /* AGC.PGACODE0 */
  /*    C0B4 */ 0x00000A98UL, /* AGC.PGACODE1 */
  /*    C0B8 */ 0x00000000UL, /* AGC.LBT */
  0x0004C0CCUL, 0x00000066UL, /* Write: AGC.LNABOOST */
  /*    C0D0 */ 0x00000000UL, /* AGC.ANTDIV */
  /*    C0D4 */ 0x000A0001UL, /* AGC.DUALRFPKDTHD0 */
  /*    C0D8 */ 0x00280001UL, /* AGC.DUALRFPKDTHD1 */
  0x01024044UL, 0x00000000UL, /* Write: MODEM.AFCADJTX */
  /*    4048 */ 0x00000010UL, /* MODEM.MIXCTRL */
  0x0101405CUL, 0x03000000UL, /* Write: MODEM.CTRL4 */
  0x010F409CUL, 0x00000000UL, /* Write: MODEM.SHAPING2 */
  /*    40A0 */ 0x00000000UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x00000000UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x00000000UL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x00000000UL, /* MODEM.SHAPING6 */
  /*    40B0 */ 0x00000000UL, /* MODEM.SHAPING7 */
  /*    40B4 */ 0x00000000UL, /* MODEM.SHAPING8 */
  /*    40B8 */ 0x00000000UL, /* MODEM.SHAPING9 */
  /*    40BC */ 0x00000000UL, /* MODEM.SHAPING10 */
  /*    40C0 */ 0x00000000UL, /* MODEM.SHAPING11 */
  /*    40C4 */ 0x00000000UL, /* MODEM.SHAPING12 */
  /*    40C8 */ 0x00000000UL, /* MODEM.SHAPING13 */
  /*    40CC */ 0x00000000UL, /* MODEM.SHAPING14 */
  /*    40D0 */ 0x00000000UL, /* MODEM.SHAPING15 */
  /*    40D4 */ 0x00000000UL, /* MODEM.OOKSHAPING */
  0x110140E0UL, 0x000001F8UL, /* AND: MODEM.ANARAMPCTRL */
  0x310140E0UL, 0x00000201UL, /* OR: MODEM.ANARAMPCTRL */
  0x01024110UL, 0x00051E33UL, /* Write: MODEM.DCCOMP */
  /*    4114 */ 0x00000000UL, /* MODEM.DCCOMPFILTINIT */
  0x01054124UL, 0x078304FFUL, /* Write: MODEM.DSATHD0 */
  /*    4128 */ 0x3AC81388UL, /* MODEM.DSATHD1 */
  /*    412C */ 0x0C6606FFUL, /* MODEM.DSATHD2 */
  /*    4130 */ 0x078304FFUL, /* MODEM.DSATHD3 */
  /*    4134 */ 0x03FF1388UL, /* MODEM.DSATHD4 */
  0x01014158UL, 0x00000000UL, /* Write: MODEM.AUTOCG */
  0x01014164UL, 0x0000010CUL, /* Write: MODEM.DIRECTMODE */
  0x01014184UL, 0x00000101UL, /* Write: MODEM.LRFRC */
  0x010141A4UL, 0x00000000UL, /* Write: MODEM.SYNCPROPERTIES */
  0x010141B0UL, 0x00000000UL, /* Write: MODEM.PADEBUG */
  0x010641B8UL, 0x00000000UL, /* Write: MODEM.ETSCTRL */
  /*    41BC */ 0x00000000UL, /* MODEM.ETSTIM */
  /*    41C0 */ 0x003C0000UL, /* MODEM.ANTSWCTRL */
  /*    41C4 */ 0x0006AAAAUL, /* MODEM.ANTSWCTRL1 */
  /*    41C8 */ 0x00000000UL, /* MODEM.ANTSWSTART */
  /*    41CC */ 0x00000000UL, /* MODEM.ANTSWEND */
  0x010141DCUL, 0x00000000UL, /* Write: MODEM.CFGANTPATT */
  0x01014220UL, 0x00000000UL, /* Write: MODEM.CHFLATENCYCTRL */
  0x0101422CUL, 0x40001860UL, /* Write: MODEM.RXRESTART */
  0x0101423CUL, 0x00000000UL, /* Write: MODEM.ANTDIVCTRL */
  0x01024244UL, 0x00000014UL, /* Write: MODEM.PHDMODANTDIV */
  /*    4248 */ 0x00000000UL, /* MODEM.PHANTDECSION */
  0x01014340UL, 0x00000000UL, /* Write: MODEM.BCRDEMODAFC0 */
  0x01018010UL, 0x00000003UL, /* Write: SYNTH.CTRL */
  0x0101803CUL, 0x00000003UL, /* Write: SYNTH.DIVCTRL */
  0x0102809CUL, 0x00000000UL, /* Write: SYNTH.LPFCTRL1CAL */
  /*    80A0 */ 0x0003B870UL, /* SYNTH.LPFCTRL1RX */
  0x110180A8UL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01014201UL, /* OR: SYNTH.LPFCTRL2RX */
  0x010180B0UL, 0x02000300UL, /* Write: SYNTH.DSMCTRLRX */
  0x02030098UL, 0x00000000UL, /* Write: RAC.SYNTHENCTRL */
  /*    009C */ 0x04000C00UL, /* RAC.SYNTHREGCTRL */
  /*    00A0 */ 0x0000044CUL, /* RAC.VCOCTRL */
  0x020200D8UL, 0xAA400005UL, /* Write: RAC.CLKMULTEN0 */
  /*    00DC */ 0x00000188UL, /* RAC.CLKMULTEN1 */
  0x120100ECUL, 0x00000FE0UL, /* AND: RAC.IFADCTRIM0 */
  0x320100ECUL, 0x5151200DUL, /* OR: RAC.IFADCTRIM0 */
  0x020100F0UL, 0x0000052BUL, /* Write: RAC.IFADCTRIM1 */
  0x02010100UL, 0x00000110UL, /* Write: RAC.LNAMIXTRIM0 */
  0x12010104UL, 0x00000000UL, /* AND: RAC.LNAMIXTRIM1 */
  0x32010104UL, 0x00000110UL, /* OR: RAC.LNAMIXTRIM1 */
  0x12010110UL, 0x000FFF00UL, /* AND: RAC.LNAMIXTRIM4 */
  0x32010110UL, 0x42000002UL, /* OR: RAC.LNAMIXTRIM4 */
  0x1201012CUL, 0x001FFC00UL, /* AND: RAC.PATRIM3 */
  0x3201012CUL, 0x008000A9UL, /* OR: RAC.PATRIM3 */
  0x02010140UL, 0x0000003FUL, /* Write: RAC.TXRAMP */
  0x12010150UL, 0x0000C000UL, /* AND: RAC.PGACTRL */
  0x32010150UL, 0x00510061UL, /* OR: RAC.PGACTRL */
  0x02010168UL, 0x00060000UL, /* Write: RAC.RX */
  0x12010178UL, 0x001C0000UL, /* AND: RAC.SYTRIM1 */
  0x32010178UL, 0xCFE00440UL, /* OR: RAC.SYTRIM1 */
  0x0201018CUL, 0x00000000UL, /* Write: RAC.SYDIVCTRL */
  0x120101ACUL, 0x000001F8UL, /* AND: RAC.IFADCPLLDCO */
  0x320101ACUL, 0x00010204UL, /* OR: RAC.IFADCPLLDCO */
  0x020101B0UL, 0x00000000UL, /* Write: RAC.IFADCPLLEN */
  0x03017FF8UL, 0x00000000UL, /* Write: SEQ.MISC */
  0xFFFFFFFFUL,
};

const uint32_t zwave_40kb_0_modemConfig[] = {
  0x03017FFCUL, (uint32_t) &phyInfo_0, /* Write: SEQ.PHYINFO */
  0x0002400CUL, 0x00198F01UL, /* Write: FRC.DFLCTRL */
  /*    4010 */ 0x000040B1UL, /* FRC.MAXLENGTH */
  0x00024020UL, 0x00000000UL, /* Write: FRC.WCNTCMP0 */
  /*    4024 */ 0x00000007UL, /* FRC.WCNTCMP1 */
  0x00014048UL, 0x000007A4UL, /* Write: FRC.CTRL */
  0x00044108UL, 0x00004807UL, /* Write: FRC.FCD0 */
  /*    410C */ 0x00004CFFUL, /* FRC.FCD1 */
  /*    4110 */ 0x00004907UL, /* FRC.FCD2 */
  /*    4114 */ 0x00004DFFUL, /* FRC.FCD3 */
  0x1001C020UL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C020UL, 0x002801FEUL, /* OR: AGC.CTRL0 */
  0x0001C03CUL, 0x003F10FCUL, /* Write: AGC.CTRL7 */
  0x0004C058UL, 0xE61A001CUL, /* Write: AGC.AGCPERIOD0 */
  /*    C05C */ 0x00000054UL, /* AGC.AGCPERIOD1 */
  /*    C060 */ 0x1918150AUL, /* AGC.HICNTREGION0 */
  /*    C064 */ 0x0000001AUL, /* AGC.HICNTREGION1 */
  0x0001C06CUL, 0x000004E0UL, /* Write: AGC.GAINSTEPLIM0 */
  0x01010008UL, 0x000007A0UL, /* Write: RFCRC.CTRL */
  0x01010018UL, 0x000000FFUL, /* Write: RFCRC.INIT */
  0x01010020UL, 0x00000080UL, /* Write: RFCRC.POLY */
  0x01014040UL, 0x30F00000UL, /* Write: MODEM.AFCADJRX */
  0x0104404CUL, 0x04000002UL, /* Write: MODEM.CTRL0 */
  /*    4050 */ 0x0082C02DUL, /* MODEM.CTRL1 */
  /*    4054 */ 0x20003200UL, /* MODEM.CTRL2 */
  /*    4058 */ 0x000BD000UL, /* MODEM.CTRL3 */
  0x010F4060UL, 0x00000000UL, /* Write: MODEM.CTRL5 */
  /*    4064 */ 0x00000000UL, /* MODEM.CTRL6 */
  /*    4068 */ 0x00F87611UL, /* MODEM.TXBR */
  /*    406C */ 0x00000841UL, /* MODEM.RXBR */
  /*    4070 */ 0x00040048UL, /* MODEM.CF */
  /*    4074 */ 0x00250012UL, /* MODEM.PRE */
  /*    4078 */ 0x000003EAUL, /* MODEM.SYNC0 */
  /*    407C */ 0x00000000UL, /* MODEM.SYNC1 */
  /*    4080 */ 0x00000609UL, /* MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x000A0375UL, /* MODEM.MODINDEX */
  /*    408C */ 0x62088000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x17030000UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x5454523EUL, /* MODEM.SHAPING1 */
  0x0102411CUL, 0x8C555000UL, /* Write: MODEM.SRCCHF */
  /*    4120 */ 0x00000000UL, /* MODEM.INTAFC */
  0x01074138UL, 0xF00A20BCUL, /* Write: MODEM.DSACTRL */
  /*    413C */ 0x0051B918UL, /* MODEM.DIGMIXCTRL */
  /*    4140 */ 0x40993267UL, /* MODEM.VITERBIDEMOD */
  /*    4144 */ 0xA83FFFFFUL, /* MODEM.VTCORRCFG0 */
  /*    4148 */ 0xB171FF99UL, /* MODEM.VTCORRCFG1 */
  /*    414C */ 0x00403B89UL, /* MODEM.VTTRACK */
  /*    4150 */ 0x800003C0UL, /* MODEM.VTBLETIMING */
  0x0101415CUL, 0x0000FDFFUL, /* Write: MODEM.CGCLKSTOP */
  0x0106416CUL, 0x40000000UL, /* Write: MODEM.LONGRANGE1 */
  /*    4170 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4174 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4178 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    417C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4180 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  0x01044188UL, 0x00000000UL, /* Write: MODEM.COH0 */
  /*    418C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4190 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4194 */ 0x00000000UL, /* MODEM.COH3 */
  0x010141A8UL, 0x00000000UL, /* Write: MODEM.DIGIGAINCTRL */
  0x010141B4UL, 0xC02BD08CUL, /* Write: MODEM.REALTIMCFE */
  0x010341D0UL, 0xAAAAAAAAUL, /* Write: MODEM.TRECPMPATT */
  /*    41D4 */ 0x801680D2UL, /* MODEM.TRECPMDET */
  /*    41D8 */ 0x00020005UL, /* MODEM.TRECSCFG */
  0x010F41E4UL, 0x0451AC29UL, /* Write: MODEM.CHFCOE00 */
  /*    41E8 */ 0x002E1F2FUL, /* MODEM.CHFCOE01 */
  /*    41EC */ 0x0005BDE8UL, /* MODEM.CHFCOE02 */
  /*    41F0 */ 0x002DD3E5UL, /* MODEM.CHFCOE03 */
  /*    41F4 */ 0x0DB17C5EUL, /* MODEM.CHFCOE04 */
  /*    41F8 */ 0x03CEBC0CUL, /* MODEM.CHFCOE05 */
  /*    41FC */ 0x307C262CUL, /* MODEM.CHFCOE06 */
  /*    4200 */ 0x0C81901EUL, /* MODEM.CHFCOE10 */
  /*    4204 */ 0x0006490CUL, /* MODEM.CHFCOE11 */
  /*    4208 */ 0x006DDFA8UL, /* MODEM.CHFCOE12 */
  /*    420C */ 0x00B10BC0UL, /* MODEM.CHFCOE13 */
  /*    4210 */ 0x00A53D18UL, /* MODEM.CHFCOE14 */
  /*    4214 */ 0x05020AE8UL, /* MODEM.CHFCOE15 */
  /*    4218 */ 0x1DD71B27UL, /* MODEM.CHFCOE16 */
  /*    421C */ 0x80000000UL, /* MODEM.CHFCTRL */
  0x01024224UL, 0xC000014CUL, /* Write: MODEM.FRMSCHTIME */
  /*    4228 */ 0x00000000UL, /* MODEM.PREFILTCOEFF */
  0x01024230UL, 0x004C0001UL, /* Write: MODEM.SQ */
  /*    4234 */ 0x00100140UL, /* MODEM.SQEXT */
  0x0101424CUL, 0x54040008UL, /* Write: MODEM.PHDMODCTRL */
  0x01014254UL, 0x0000008DUL, /* Write: MODEM.LOG2X4 */
  0x01044330UL, 0x08020C4AUL, /* Write: MODEM.BCRCTRL0 */
  /*    4334 */ 0x80FA810AUL, /* MODEM.BCRCTRL1 */
  /*    4338 */ 0x86F52000UL, /* MODEM.BCRDEMODCTRL */
  /*    433C */ 0x00A80C06UL, /* MODEM.BCRDEMODOOK */
  0x010A4344UL, 0xD2E00023UL, /* Write: MODEM.BCRDEMODAFC1 */
  /*    4348 */ 0x40008555UL, /* MODEM.BCRDEMOD4FSK0 */
  /*    434C */ 0x80000002UL, /* MODEM.BCRDEMOD4FSK1 */
  /*    4350 */ 0x00020020UL, /* MODEM.BCRDEMODANT */
  /*    4354 */ 0x00000478UL, /* MODEM.BCRDEMODRSSI */
  /*    4358 */ 0x98878512UL, /* MODEM.BCRDEMODARR0 */
  /*    435C */ 0x9728220BUL, /* MODEM.BCRDEMODARR1 */
  /*    4360 */ 0x00000000UL, /* MODEM.BCRDEMODARR2 */
  /*    4364 */ 0x00260000UL, /* MODEM.BCRDEMODKSI */
  /*    4368 */ 0xA0FA5555UL, /* MODEM.BCRDEMODPMEXP */
  0x01018038UL, 0x00106E46UL, /* Write: SYNTH.IFFREQ */
  0x010180A4UL, 0x0003B870UL, /* Write: SYNTH.LPFCTRL1TX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x01014201UL, /* OR: SYNTH.LPFCTRL2TX */
  0x010180B4UL, 0x02000300UL, /* Write: SYNTH.DSMCTRLTX */
  0x0201016CUL, 0x00062000UL, /* Write: RAC.TX */
  0x02010174UL, 0x0C100169UL, /* Write: RAC.SYTRIM0 */
  0x12010180UL, 0x00000779UL, /* AND: RAC.SYEN */
  0x32010180UL, 0x00000006UL, /* OR: RAC.SYEN */
  0x02010188UL, 0x00000090UL, /* Write: RAC.SYMMDCTRL */
  0xFFFFFFFFUL,
};

const uint32_t zwave_9p6kb_0_modemConfig[] = {
  0x03017FFCUL, (uint32_t) &phyInfo_1, /* Write: SEQ.PHYINFO */
  0x0002400CUL, 0x00198F01UL, /* Write: FRC.DFLCTRL */
  /*    4010 */ 0x000040B1UL, /* FRC.MAXLENGTH */
  0x00024020UL, 0x00000000UL, /* Write: FRC.WCNTCMP0 */
  /*    4024 */ 0x00000007UL, /* FRC.WCNTCMP1 */
  0x00014048UL, 0x000007A4UL, /* Write: FRC.CTRL */
  0x00044108UL, 0x00004807UL, /* Write: FRC.FCD0 */
  /*    410C */ 0x00004CFFUL, /* FRC.FCD1 */
  /*    4110 */ 0x00004907UL, /* FRC.FCD2 */
  /*    4114 */ 0x00004DFFUL, /* FRC.FCD3 */
  0x1001C020UL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C020UL, 0x002801FEUL, /* OR: AGC.CTRL0 */
  0x0001C03CUL, 0x013F10FCUL, /* Write: AGC.CTRL7 */
  0x0004C058UL, 0xE61A001CUL, /* Write: AGC.AGCPERIOD0 */
  /*    C05C */ 0x00000054UL, /* AGC.AGCPERIOD1 */
  /*    C060 */ 0x1918150AUL, /* AGC.HICNTREGION0 */
  /*    C064 */ 0x0000001AUL, /* AGC.HICNTREGION1 */
  0x0001C06CUL, 0x000004E0UL, /* Write: AGC.GAINSTEPLIM0 */
  0x01010008UL, 0x000007A0UL, /* Write: RFCRC.CTRL */
  0x01010018UL, 0x000000FFUL, /* Write: RFCRC.INIT */
  0x01010020UL, 0x00000080UL, /* Write: RFCRC.POLY */
  0x01014040UL, 0x30F00000UL, /* Write: MODEM.AFCADJRX */
  0x0104404CUL, 0x04000010UL, /* Write: MODEM.CTRL0 */
  /*    4050 */ 0x0082C03FUL, /* MODEM.CTRL1 */
  /*    4054 */ 0x20003200UL, /* MODEM.CTRL2 */
  /*    4058 */ 0x000BD000UL, /* MODEM.CTRL3 */
  0x010F4060UL, 0x00000000UL, /* Write: MODEM.CTRL5 */
  /*    4064 */ 0x00000000UL, /* MODEM.CTRL6 */
  /*    4068 */ 0x00807EF4UL, /* MODEM.TXBR */
  /*    406C */ 0x00000B11UL, /* MODEM.RXBR */
  /*    4070 */ 0x00040048UL, /* MODEM.CF */
  /*    4074 */ 0x00240036UL, /* MODEM.PRE */
  /*    4078 */ 0xAA556666UL, /* MODEM.SYNC0 */
  /*    407C */ 0x00000000UL, /* MODEM.SYNC1 */
  /*    4080 */ 0x00000309UL, /* MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x000A0373UL, /* MODEM.MODINDEX */
  /*    408C */ 0x62088000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x17030000UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x5454523EUL, /* MODEM.SHAPING1 */
  0x0102411CUL, 0x04555000UL, /* Write: MODEM.SRCCHF */
  /*    4120 */ 0x00000000UL, /* MODEM.INTAFC */
  0x01074138UL, 0xF00A20BCUL, /* Write: MODEM.DSACTRL */
  /*    413C */ 0x0051B918UL, /* MODEM.DIGMIXCTRL */
  /*    4140 */ 0x40972E5EUL, /* MODEM.VITERBIDEMOD */
  /*    4144 */ 0xA83FFFFFUL, /* MODEM.VTCORRCFG0 */
  /*    4148 */ 0xB171FF97UL, /* MODEM.VTCORRCFG1 */
  /*    414C */ 0x00403B89UL, /* MODEM.VTTRACK */
  /*    4150 */ 0x800003C0UL, /* MODEM.VTBLETIMING */
  0x0101415CUL, 0x0000FDFFUL, /* Write: MODEM.CGCLKSTOP */
  0x0106416CUL, 0x40000000UL, /* Write: MODEM.LONGRANGE1 */
  /*    4170 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4174 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4178 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    417C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4180 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  0x01044188UL, 0x00000000UL, /* Write: MODEM.COH0 */
  /*    418C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4190 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4194 */ 0x00000000UL, /* MODEM.COH3 */
  0x010141A8UL, 0x00000000UL, /* Write: MODEM.DIGIGAINCTRL */
  0x010141B4UL, 0xC02FD08CUL, /* Write: MODEM.REALTIMCFE */
  0x010341D0UL, 0x33333333UL, /* Write: MODEM.TRECPMPATT */
  /*    41D4 */ 0x801680DAUL, /* MODEM.TRECPMDET */
  /*    41D8 */ 0x00020005UL, /* MODEM.TRECSCFG */
  0x010F41E4UL, 0x0451AC29UL, /* Write: MODEM.CHFCOE00 */
  /*    41E8 */ 0x002E1F2FUL, /* MODEM.CHFCOE01 */
  /*    41EC */ 0x0005BDE8UL, /* MODEM.CHFCOE02 */
  /*    41F0 */ 0x002DD3E5UL, /* MODEM.CHFCOE03 */
  /*    41F4 */ 0x0DB17C5EUL, /* MODEM.CHFCOE04 */
  /*    41F8 */ 0x03CEBC0CUL, /* MODEM.CHFCOE05 */
  /*    41FC */ 0x307C262CUL, /* MODEM.CHFCOE06 */
  /*    4200 */ 0x0C81901EUL, /* MODEM.CHFCOE10 */
  /*    4204 */ 0x0006490CUL, /* MODEM.CHFCOE11 */
  /*    4208 */ 0x006DDFA8UL, /* MODEM.CHFCOE12 */
  /*    420C */ 0x00B10BC0UL, /* MODEM.CHFCOE13 */
  /*    4210 */ 0x00A53D18UL, /* MODEM.CHFCOE14 */
  /*    4214 */ 0x05020AE8UL, /* MODEM.CHFCOE15 */
  /*    4218 */ 0x1DD71B27UL, /* MODEM.CHFCOE16 */
  /*    421C */ 0x80000000UL, /* MODEM.CHFCTRL */
  0x01024224UL, 0xC00000ACUL, /* Write: MODEM.FRMSCHTIME */
  /*    4228 */ 0x00000000UL, /* MODEM.PREFILTCOEFF */
  0x01024230UL, 0x004C0001UL, /* Write: MODEM.SQ */
  /*    4234 */ 0x00860258UL, /* MODEM.SQEXT */
  0x0101424CUL, 0x54040008UL, /* Write: MODEM.PHDMODCTRL */
  0x01014254UL, 0x0000008DUL, /* Write: MODEM.LOG2X4 */
  0x01044330UL, 0x0001E3F5UL, /* Write: MODEM.BCRCTRL0 */
  /*    4334 */ 0x810F810AUL, /* MODEM.BCRCTRL1 */
  /*    4338 */ 0x96F52001UL, /* MODEM.BCRDEMODCTRL */
  /*    433C */ 0x00A40C06UL, /* MODEM.BCRDEMODOOK */
  0x010A4344UL, 0xD2E00023UL, /* Write: MODEM.BCRDEMODAFC1 */
  /*    4348 */ 0x40008555UL, /* MODEM.BCRDEMOD4FSK0 */
  /*    434C */ 0x80000002UL, /* MODEM.BCRDEMOD4FSK1 */
  /*    4350 */ 0x00020020UL, /* MODEM.BCRDEMODANT */
  /*    4354 */ 0x00000478UL, /* MODEM.BCRDEMODRSSI */
  /*    4358 */ 0x98878512UL, /* MODEM.BCRDEMODARR0 */
  /*    435C */ 0x9728200BUL, /* MODEM.BCRDEMODARR1 */
  /*    4360 */ 0x00000000UL, /* MODEM.BCRDEMODARR2 */
  /*    4364 */ 0x00200000UL, /* MODEM.BCRDEMODKSI */
  /*    4368 */ 0xA0FA5555UL, /* MODEM.BCRDEMODPMEXP */
  0x01018038UL, 0x00106E46UL, /* Write: SYNTH.IFFREQ */
  0x010180A4UL, 0x0003B870UL, /* Write: SYNTH.LPFCTRL1TX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x01014201UL, /* OR: SYNTH.LPFCTRL2TX */
  0x010180B4UL, 0x02000300UL, /* Write: SYNTH.DSMCTRLTX */
  0x0201016CUL, 0x00062000UL, /* Write: RAC.TX */
  0x02010174UL, 0x0C100169UL, /* Write: RAC.SYTRIM0 */
  0x12010180UL, 0x00000779UL, /* AND: RAC.SYEN */
  0x32010180UL, 0x00000006UL, /* OR: RAC.SYEN */
  0x02010188UL, 0x00000090UL, /* Write: RAC.SYMMDCTRL */
  0xFFFFFFFFUL,
};

const uint32_t zwave_9p6kb_conc_0_modemConfig[] = {
  0x03017FFCUL, (uint32_t) &phyInfo_1, /* Write: SEQ.PHYINFO */
  0x0101411CUL, 0x04555000UL, /* Write: MODEM.SRCCHF */
  0x01014338UL, 0x96F52001UL, /* Write: MODEM.BCRDEMODCTRL */
  0x01014140UL, 0x40972E5EUL, /* Write: MODEM.VITERBIDEMOD */
  0x0001C03CUL, 0x013F10FCUL, /* Write: AGC.CTRL7 */
  0x0102404CUL, 0x04000010UL, /* Write: MODEM.CTRL0 */
  /*    4050 */ 0x0082C03FUL, /* MODEM.CTRL1 */
  0x01024068UL, 0x00807EF4UL, /* Write: MODEM.TXBR */
  /*    406C */ 0x00000B11UL, /* MODEM.RXBR */
  0x01044074UL, 0x00240036UL, /* Write: MODEM.PRE */
  /*    4078 */ 0xAA556666UL, /* MODEM.SYNC0 */
  /*    407C */ 0x00000000UL, /* MODEM.SYNC1 */
  /*    4080 */ 0x00000309UL, /* MODEM.TIMING */
  0x01014088UL, 0x000A0373UL, /* Write: MODEM.MODINDEX */
  0x01014148UL, 0xB171FF97UL, /* Write: MODEM.VTCORRCFG1 */
  0x010141B4UL, 0xC02FD08CUL, /* Write: MODEM.REALTIMCFE */
  0x010141D4UL, 0x801680DAUL, /* Write: MODEM.TRECPMDET */
  0x01014224UL, 0xC00000ACUL, /* Write: MODEM.FRMSCHTIME */
  0x01014234UL, 0x00860258UL, /* Write: MODEM.SQEXT */
  0x01024330UL, 0x0001E3F5UL, /* Write: MODEM.BCRCTRL0 */
  /*    4334 */ 0x810F810AUL, /* MODEM.BCRCTRL1 */
  0x0101433CUL, 0x00A40C06UL, /* Write: MODEM.BCRDEMODOOK */
  0x0103435CUL, 0x9728200BUL, /* Write: MODEM.BCRDEMODARR1 */
  /*    4360 */ 0x00000000UL, /* MODEM.BCRDEMODARR2 */
  /*    4364 */ 0x00200000UL, /* MODEM.BCRDEMODKSI */
  0x010141D0UL, 0x33333333UL, /* Write: MODEM.TRECPMPATT */
  0xFFFFFFFFUL,
};

